bscopix/Ble_Mesh_Kp/STM32_WPAN/App/app_ble.c
      bd_addr[0] = (uint8_t)(udn & 0x000000FFU);
      bd_addr[1] = (uint8_t)((udn & 0x0000FF00U) >> 8);
      bd_addr[2] = (uint8_t)(device_id & 0x000000FFU);
      bd_addr[3] = (uint8_t)(company_id & 0x000000FFU);
      bd_addr[4] = (uint8_t)((company_id & 0x0000FF00U) >> 8);
      bd_addr[5] = (uint8_t)((company_id & 0x00FF0000U) >> 16);
    }
    else
    {
      uint64_t fallback = GetMacAdd();
      bd_addr[0] = (uint8_t)(fallback & 0x00000000000000FFULL);
      bd_addr[1] = (uint8_t)((fallback & 0x000000000000FF00ULL) >> 8);
      bd_addr[2] = (uint8_t)((fallback & 0x0000000000FF0000ULL) >> 16);
      bd_addr[3] = (uint8_t)((fallback & 0x00000000FF000000ULL) >> 24);
      bd_addr[4] = (uint8_t)((fallback & 0x000000FF00000000ULL) >> 32);
      bd_addr[5] = (uint8_t)((fallback & 0x0000FF0000000000ULL) >> 40);
    }

    ret_addr = aci_hal_write_config_data(CONFIG_DATA_PUBADDR_OFFSET,
                       CONFIG_DATA_PUBADDR_LEN,
                                         bd_addr);
    if (ret_addr != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("  Fail   : aci_hal_write_config_data command - CONFIG_DATA_PUBLIC_ADDRESS_OFFSET, result: 0x%x\n", ret_addr);
    }
    else
    {
      APP_DBG_MSG("  Success: aci_hal_write_config_data command - CONFIG_DATA_PUBLIC_ADDRESS_OFFSET\n");
      APP_DBG_MSG("  Public Bluetooth Address: %02x:%02x:%02x:%02x:%02x:%02x\n",
                  bd_addr[5],
                  bd_addr[4],
                  bd_addr[3],
                  bd_addr[2],
                  bd_addr[1],
                  bd_addr[0]);
    }
  }
  APP_DBG_MSG("==>> Mesh autostart enabled: skip legacy Ble_Hci_Gap_Gatt_Init\n");
#endif

  /**
   * Initialization of the BLE Services
   */
  SVCCTL_Init();

  /**
   * Initialization of the BLE App Context
   */
  BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;
  BleApplicationContext.BleApplicationContext_legacy.connectionHandle = 0xFFFF;

  /**
   * From here, all initialization are BLE application specific
   */
  UTIL_SEQ_RegTask(1<<CFG_TASK_ADV_CANCEL_ID, UTIL_SEQ_RFU, Adv_Cancel);
#if (L2CAP_REQUEST_NEW_CONN_PARAM != 0)
  UTIL_SEQ_RegTask(1<<CFG_TASK_CONN_UPDATE_REG_ID, UTIL_SEQ_RFU, Connection_Interval_Update_Req);
#endif /* L2CAP_REQUEST_NEW_CONN_PARAM != 0 */

  /**
   * Initialization of ADV - Ad Manufacturer Element - Support OTA Bit Mask
   */
#if (BLE_CFG_OTA_REBOOT_CHAR != 0)
  a_ManufData[sizeof(a_ManufData)-8] = CFG_FEATURE_OTA_REBOOT;
#endif /* BLE_CFG_OTA_REBOOT_CHAR != 0 */

#if (RADIO_ACTIVITY_EVENT != 0)
  ret = aci_hal_set_radio_activity_mask(0x0006);
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("  Fail   : aci_hal_set_radio_activity_mask command, result: 0x%x \n\r", ret);
  }
  else
  {
    APP_DBG_MSG("  Success: aci_hal_set_radio_activity_mask command\n\r");
  }
#endif /* RADIO_ACTIVITY_EVENT != 0 */

#if (L2CAP_REQUEST_NEW_CONN_PARAM != 0)
  index_con_int = 0;
  mutex = 1;
#endif /* L2CAP_REQUEST_NEW_CONN_PARAM != 0 */
  DISAPP_Init();

	BASAPP_Init(0);
  /**
   * Initialize P2P Server Application
   */
  P2PS_APP_Init();

  /* USER CODE BEGIN APP_BLE_Init_3 */
	//UTIL_SEQ_RegTask( 1<< CFG_TASK_SHOT_ADV_ID, UTIL_SEQ_RFU, update_adv_shot_data );
	UTIL_SEQ_RegTask( 1<< CFG_TASK_SHOT_ADV_ID, UTIL_SEQ_RFU, additionnal_adv );
	UTIL_SEQ_RegTask(1<<CFG_TASK_SHOT_ADV_CANCEL_ID, UTIL_SEQ_RFU, additionnal_adv_Cancel);
	/**
   * Create timer to handle the Shot Advertising Stop
   */
  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &(BleApplicationContext.Advertising_additionnal_timer_Id), hw_ts_SingleShot, additionnal_adv_Cancel);
  /* USER CODE END APP_BLE_Init_3 */

  /**
   * Create timer to handle the Advertising Stop
   */
  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &(BleApplicationContext.Advertising_mgr_timer_Id), hw_ts_SingleShot, Adv_Cancel_Req);
  /**
   * Create timer to handle the Led Switch OFF
   */
  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &(BleApplicationContext.SwitchOffGPIO_timer_Id), hw_ts_SingleShot, Switch_OFF_GPIO);

  /**
   * Make device discoverable
   */
  BleApplicationContext.BleApplicationContext_legacy.advtServUUID[0] = NULL;
  BleApplicationContext.BleApplicationContext_legacy.advtServUUIDlen = 0;

  /* Initialize intervals for reconnexion without intervals update */
  AdvIntervalMin = CFG_FAST_CONN_ADV_INTERVAL_MIN;
  AdvIntervalMax = CFG_FAST_CONN_ADV_INTERVAL_MAX;

  /**
   * Start legacy advertising only when Mesh autostart is disabled.
   * With Mesh autostart enabled, provisioning shall run in Mesh-only mode
   * (same principle as BLE_MeshLightingPRFNode).
   */
#ifdef DISABLE_MESH_AUTOSTART
  if (!IsProvisioningRuntimeSessionActive())
  {
    Adv_Request(APP_BLE_FAST_ADV);
    /* Start additional beacon only after primary discoverable advertising is requested. */
    additionnal_adv();
  }
  else
  {
    APP_DBG_MSG("==>> Mesh provisioning runtime active: legacy GAP advertising disabled\n");
  }
  /* USER CODE BEGIN APP_BLE_Init_2 */
#else
  APP_DBG_MSG("==>> Mesh autostart enabled: legacy GAP advertising/beacon disabled\n");
#endif

  /* USER CODE END APP_BLE_Init_2 */

  return;
}

SVCCTL_UserEvtFlowStatus_t SVCCTL_App_Notification(void *p_Pckt)
{
  hci_event_pckt    *p_event_pckt;
  evt_le_meta_event *p_meta_evt;
  evt_blecore_aci   *p_blecore_evt;
  uint8_t           Tx_phy, Rx_phy;
  tBleStatus        ret = BLE_STATUS_INVALID_PARAMS;
  hci_le_connection_complete_event_rp0        *p_connection_complete_event;
  hci_disconnection_complete_event_rp0        *p_disconnection_complete_event;
  hci_le_phy_update_complete_event_rp0        *p_evt_le_phy_update_complete;
#if (CFG_DEBUG_APP_TRACE != 0)
  hci_le_connection_update_complete_event_rp0 *p_connection_update_complete_event;
#endif /* CFG_DEBUG_APP_TRACE != 0 */

  /* USER CODE BEGIN SVCCTL_App_Notification */

  /* USER CODE END SVCCTL_App_Notification */

  p_event_pckt = (hci_event_pckt*) ((hci_uart_pckt *) p_Pckt)->data;

#ifndef DISABLE_MESH_AUTOSTART
  /* In mesh autostart mode, always forward BLE events to mesh dispatcher. */
  HCI_Event_CB(p_Pckt);
#if (LOW_POWER_FEATURE == 1)
  UTIL_SEQ_SetTask(1 << CFG_TASK_MESH_REQ_ID, CFG_SCH_PRIO_0);
#endif

  return (SVCCTL_UserEvtFlowEnable);
#endif

  /* Keep Mesh event processing active even when booting in legacy GATT mode. */
  HCI_Event_CB(p_Pckt);

